Notes/daily/2021-10-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-10-27</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="title">2021-10-27</span><div class="links"><a href="/">Home</a><a href="/home/runner/work/EPQ/EPQ/Notes/daily/ltximg">Latest daily note</a></div></div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org48b016f">Today's task list</a></li>
<li><a href="#org4f1a233">Diary entry</a>
<ul>
<li><a href="#org282d300">What have I done since the last entry?</a></li>
<li><a href="#org8073e56">What have I learned &amp; how?</a></li>
<li><a href="#orgb5388da">What worked well?</a></li>
<li><a href="#orgefe393d">What would I do differently next time?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org48b016f" class="outline-2">
<h2 id="org48b016f">Today's task list</h2>
<div class="outline-text-2" id="text-org48b016f">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Copy the PPR to documents
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Get permission from OCR to publish PPR</li>
<li class="off"><code>[&#xa0;]</code> Copy it over</li>
</ul></li>
<li class="on"><code>[X]</code> Templates should be created for daily diary notes</li>
<li class="off"><code>[&#xa0;]</code> Go to Moodle and look at the 'Examples of projects from Hills students'.
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Make notes on these examples
<ul class="org-ul">
<li>What are the strengths and weaknesses?</li>
<li>What can you learn from these?</li>
<li>How will this influence the way you work?</li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> Make a credits.org page displaying links to everything and everyone that's helped me in getting this project</li>
<li class="off"><code>[&#xa0;]</code> Add a link back to the main page from each page on the site, as well as a link to the source on github</li>
</ul>

<p>
As predicted, no tasks were done yesterday. Today I plan to start off by making a template for diary notes, as this is something I will need to do sooner or later (and sooner rather than later).
</p>

<p>
I've created 2 templates; a default (empty) one, and a template for diaries, here's what they look like!
</p>
</div>
</div>
<div id="outline-container-org4f1a233" class="outline-2">
<h2 id="org4f1a233">Diary entry</h2>
<div class="outline-text-2" id="text-org4f1a233">
</div>
<div id="outline-container-org282d300" class="outline-3">
<h3 id="org282d300">What have I done since the last entry?</h3>
<div class="outline-text-3" id="text-org282d300">
<p>
This is the first entry, over the course of the project so far I've:
</p>
<ul class="org-ul">
<li>Decided on what my project is going to be
<ul class="org-ul">
<li><a href="file:///home/runner/School/EPQ/Notes/20211024201928-upper_6th_meeting.html">Talked to upper 6ths about what makes a good project idea</a></li>
<li>Got information about what the project is</li>
<li><a href="file:///home/runner/School/EPQ/Documents/project-idea-mindmap.html">Mindmapped what ideas would be good</a></li>
</ul></li>
<li>Set up this website</li>
<li>Done a little research on docker &amp; LXC (yet to be written up here)</li>
<li>Done a little research on what people who will be using the project want, including <a href="file:///home/runner/School/EPQ/Documents/questioning-a-co-owner.html">asking a co-owner what they'd like to see in the completed project</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8073e56" class="outline-3">
<h3 id="org8073e56">What have I learned &amp; how?</h3>
<div class="outline-text-3" id="text-org8073e56">
<ul class="org-ul">
<li>I now understand the EPQ better, and what will make it up, be graded &amp; soforth</li>
</ul>
</div>
</div>
<div id="outline-container-orgb5388da" class="outline-3">
<h3 id="orgb5388da">What worked well?</h3>
<div class="outline-text-3" id="text-orgb5388da">
<ul class="org-ul">
<li>The (yet-to-be-written-up) research revealed a lot of stuff I didn't know about LXC, docker &amp; containerd, and gave me some ideas of how something like my project could be implemented</li>
</ul>
</div>
</div>
<div id="outline-container-orgefe393d" class="outline-3">
<h3 id="orgefe393d">What would I do differently next time?</h3>
<div class="outline-text-3" id="text-orgefe393d">
<ul class="org-ul">
<li>I would record the upper 6th meeting so that I could get a transcript</li>
<li>I would pre-plan the questions I was going to ask the co-owner so that I could ask more questions &amp; get more valuable information</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
